<html>
<head>
<title> Manual Introductorio HTML</title>
</head>
<h1>Manual Introductorio HTML</h1> 
<h2>Breve historia de HTML</h2>
<p>La historia completa de <em><acronym title="HiperHext Markup Languaje">HTML</acronym></em> es tan interesante como larga, por lo que a continuaci&oacute;n se muestra su <strong>historia</strong> resumida a partir de la informaci&oacute;n que se puede encontrar en la Wikipedia.<br>

El origen de HTML se remonta a 1980, cuando el f&iacute;sico Tim Berners-Lee, trabajador del <acronym title="Organizaci&oacute;n Europea para la Investigaci&oacute;n Nuclear">CERN</acronym> propuso un nuevo sistema de "hipertexto" para compartir documentos.</p>

<p>Los sistemas de "hipertexto" hab&iacute;an sido desarrollados a&ntilde;os antes. En el &aacute;mbito de la inform&aacute;tica, el "hipertexto" permit&iacute;a que los usuarios accedieran a la informaci&oacute;n relacionada con los documentos electr&oacute;nicos que estaban visualizando. De cierta manera, los primitivos sistemas de "hipertexto" podr&iacute;an asimilarse a los enlaces de las p&aacute;ginas web actuales.<br>
<img src="imagenes/foto1.jpg" alt="Tim Berners-Lee" width=400 height=600>
</p>

<p>Tras finalizar el desarrollo de su sistema de "hipertexto", Tim Berners-Lee lo present&oacute; a una convocatoria organizada para desarrollar un sistema de "hipertexto" para Internet. Despu&eacute;s de unir sus fuerzas con el ingeniero de sistemas Robert Cailliau, presentaron la propuesta ganadora llamada <dfn title="sistema de documentos de hipertexto que se encuentran enlazados entre s&iacute; y a los que se accede por medio de Internet.">WorldWideWeb (W3)</dfn>.<br>

El primer documento formal con la descripci&oacute;n de HTML se public&oacute; en 1991 bajo el nombre HTML Tags (Etiquetas HTML) y todav&iacute;a hoy puede ser consultado online a modo de reliquia inform&aacute;tica.</p>

<p>La primera propuesta oficial para convertir HTML en un est&aacute;ndar se realiz&oacute; en 1993 por parte del organismo IETF (Internet Engineering Task Force). Aunque se consiguieron avances significativos (en esta &eacute;poca se definieron las etiquetas para im&aacute;genes, tablas y formularios) ninguna de las dos propuestas de est&aacute;ndar, llamadas HTML y HTML+ consiguieron convertirse en est&aacute;ndar oficial.</p>

<p>En 1995, el organismo IETF organiza un grupo de trabajo de HTML y consigue publicar, el 22 de septiembre de ese mismo a&ntilde;o, el est&aacute;ndar HTML 2.0. A pesar de su nombre, HTML 2.0 es el primer est&aacute;ndar oficial de HTML.</p>

<p>A partir de 1996, los est&aacute;ndares de HTML los publica otro organismo de estandarizaci&oacute;n llamado W3C (World Wide Web Consortium). La versi&oacute;n HTML 3.2 se public&oacute; el 14 de Enero de 1997 y es la primera recomendaci&oacute;n de HTML publicada por el W3C. Esta revisi&oacute;n incorpora los &uacute;ltimos avances de las p&aacute;ginas web desarrolladas hasta 1996, como applets de Java y texto que fluye alrededor de las im&aacute;genes.</p>

<p>HTML 4.0 se public&oacute; el 24 de Abril de 1998 (siendo una versi&oacute;n corregida de la publicaci&oacute;n original del 18 de Diciembre de 1997) y supone un gran salto desde las versiones anteriores. Entre sus novedades m&aacute;s destacadas se encuentran las hojas de estilos CSS, la posibilidad de incluir peque&ntilde;os programas o scripts en las p&aacute;ginas web, mejora de la accesibilidad de las p&aacute;ginas dise&ntilde;adas, tablas complejas y mejoras en los formularios.</p>

<p>La &uacute;ltima especificaci&oacute;n oficial de HTML se public&oacute; el 24 de diciembre de 1999 y se denomina HTML 4.01. Se trata de una revisi&oacute;n y actualizaci&oacute;n de la versi&oacute;n HTML 4.0, por lo que no incluye novedades significativas.</p>

<p>Desde la publicaci&oacute;n de HTML 4.01, la actividad de estandarizaci&oacute;n de HTML se detuvo y el W3C se centr&oacute; en el desarrollo del est&aacute;ndar XHTML. Por este motivo, en el a&ntilde;o 2004, las empresas Apple, Mozilla y Opera mostraron su preocupaci&oacute;n por la falta de inter&eacute;s del W3C en HTML y decidieron organizarse en una nueva asociaci&oacute;n llamada WHATWG (Web Hypertext Application Technology Working Group).</p>

<p>La actividad actual del WHATWG se centra en el futuro est&aacute;ndar HTML 5, cuyo primer borrador oficial se public&oacute; el 22 de enero de 2008. Debido a la fuerza de las empresas que forman el grupo WHATWG y a la publicaci&oacute;n de los borradores de HTML 5.0, en marzo de 2007 el W3C decidi&oacute; retomar la actividad estandarizadora de HTML.</p>

<p>De forma paralela a su actividad con HTML, W3C ha continuado con la estandarizaci&oacute;n de XHTML, una versi&oacute;n avanzada de HTML y basada en XML. La primera versi&oacute;n de XHTML se denomina XHTML 1.0 y se public&oacute; el 26 de Enero de 2000 (y posteriormente se revis&oacute; el 1 de Agosto de 2002).</p>

<p>XHTML 1.0 es una adaptaci&oacute;n de HTML 4.01 al lenguaje XML, por lo que mantiene casi todas sus etiquetas y caracter&iacute;sticas, pero a&ntilde;ade algunas restricciones y elementos propios de XML. La versi&oacute;n XHTML 1.1 ya ha sido publicada en forma de borrador y pretende modularizar XHTML. Tambi&eacute;n ha sido publicado el borrador de XHTML 2.0, que supondr&aacute; un cambio muy importante respecto de las anteriores versiones de XHTML.</p>
<h2> Ejemplo de listas en HTML</h2>
<h3> Ejemplos de listas no-numeradas</h3>
<ul>las etiquetas usadas para abundar o explicar algo son:
<li>acronym</li>
<li>dfn</li>
</ul>
<h3>Ejemplo de listas numeradas</h3>
<ol>pasos para insertar un imagen/foto1
<li>Crear una carpeta</li>
<li>Guardar la foto dentro de ella</li>
<li>Verificar la ruta donde se encuentra, respecto del origen</li>
<li>Incluir la etiqueta img en el codigo html</li> 
</ol>